In [1]:
import pandas as pd

data = {"Name": ["John", "Peter", "Lisa"],
        "Age":[25,28,31],
        "Salary": [300000,45000,25000]}
df = pd.DataFrame(data)
print(df)

    Name  Age  Salary
0   John   25  300000
1  Peter   28   45000
2   Lisa   31   25000

In [4]:
data = pd.read_csv("D:/All Files/Data Analysis/Python libraries/Pandas practice queries/company.csv")
print(data)

   Unnamed: 0      Name gender  salary
0           0    ayushi      F   20000
1           1     rohit      M   25000
2           2  pranjali      F   27000

In [15]:
data = pd.read_csv("D:/All Files/Data Analysis/Python libraries/Pandas practice queries/order_details.csv")
print(data.head(50))

    order_details_id  order_id order_date   order_time  item_id  Mode
0                  1         1   1/1/2023  11:38:36 AM    109.0  CASH
1                  2         2   1/1/2023  11:57:40 AM    108.0  CASH
2                  3         2   1/1/2023  11:57:40 AM    124.0   UPI
3                  4         2   1/1/2023  11:57:40 AM    117.0   UPI
4                  5         2   1/1/2023  11:57:40 AM    129.0   UPI
5                  6         2   1/1/2023  11:57:40 AM    106.0  CASH
6                  7         3   1/1/2023  12:12:28 PM    117.0   UPI
7                  8         3   1/1/2023  12:12:28 PM    119.0   UPI
8                  9         4   1/1/2023  12:16:31 PM    117.0   UPI
9                 10         5   1/1/2023  12:21:30 PM    117.0   UPI
10                11         6   1/1/2023  12:29:36 PM    101.0  CASH
11                12         6   1/1/2023  12:29:36 PM    114.0   UPI
12                13         7   1/1/2023  12:50:37 PM    123.0   UPI
13                14         8   1/1/2023  12:51:37 PM    123.0   UPI
14                15         9   1/1/2023  12:52:01 PM    108.0  CASH
15                16         9   1/1/2023  12:52:01 PM    126.0   UPI
16                17         9   1/1/2023  12:52:01 PM    110.0  CASH
17                18         9   1/1/2023  12:52:01 PM    117.0   UPI
18                19         9   1/1/2023  12:52:01 PM    117.0   UPI
19                20         9   1/1/2023  12:52:01 PM    129.0   UPI
20                21         9   1/1/2023  12:52:01 PM    122.0   UPI
21                22         9   1/1/2023  12:52:01 PM    130.0   UPI
22                23         9   1/1/2023  12:52:01 PM    132.0   UPI
23                24        10   1/1/2023   1:00:15 PM    129.0   UPI
24                25        10   1/1/2023   1:00:15 PM    105.0  CASH
25                26        11   1/1/2023   1:02:59 PM    101.0  CASH
26                27        11   1/1/2023   1:02:59 PM    102.0  CASH
27                28        11   1/1/2023   1:02:59 PM    102.0  CASH
28                29        11   1/1/2023   1:02:59 PM    113.0   UPI
29                30        12   1/1/2023   1:04:41 PM    102.0  CASH
30                31        12   1/1/2023   1:04:41 PM    102.0  CASH
31                32        12   1/1/2023   1:04:41 PM    104.0  CASH
32                33        12   1/1/2023   1:04:41 PM    117.0   UPI
33                34        13   1/1/2023   1:11:55 PM    129.0   UPI
34                35        14   1/1/2023   1:14:19 PM    114.0   UPI
35                36        15   1/1/2023   1:33:00 PM    107.0  CASH
36                37        15   1/1/2023   1:33:00 PM    124.0   UPI
37                38        15   1/1/2023   1:33:00 PM    121.0   UPI
38                39        15   1/1/2023   1:33:00 PM    114.0   UPI
39                40        16   1/1/2023   1:34:07 PM    125.0   UPI
40                41        16   1/1/2023   1:34:07 PM    111.0   UPI
41                42        16   1/1/2023   1:34:07 PM    106.0  CASH
42                43        17   1/1/2023   1:53:00 PM    101.0  CASH
43                44        17   1/1/2023   1:53:00 PM    116.0   UPI
44                45        17   1/1/2023   1:53:00 PM    124.0   UPI
45                46        17   1/1/2023   1:53:00 PM    125.0   UPI
46                47        17   1/1/2023   1:53:00 PM    117.0   UPI
47                48        17   1/1/2023   1:53:00 PM    127.0   UPI
48                49        17   1/1/2023   1:53:00 PM    128.0   UPI
49                50        17   1/1/2023   1:53:00 PM    129.0   UPI

# Exploring data in python

In [21]:
data = pd.read_excel("D:/All Files/Data Analysis/Python libraries/Pandas practice queries/ESD.xlsx")
print(data.head(10))
print(data.tail(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT
5     0.00          China  Chongqing        NaT
6     0.10  United States    Phoenix        NaT
7     0.00  United States      Miami 2021-05-20
8     0.06  United States     Austin        NaT
9     0.00  United States    Chicago        NaT
       EEID          Full Name             Job Title       Department  \
990  E01578       Anthony Hong            Sr. Manger               IT
991  E03430        Leo Herrera  Sr. Business Partner  Human Resources
992  E03058      Robert Wright   Technical Architect               IT
993  E04762  Audrey Richardson              Director               IT
994  E01148     Scarlett Kumar       Systems Analyst               IT
995  E03094       Wesley Young           Sr. Analyst        Marketing
996  E01909       Lillian Khan               Analyst          Finance
997  E04398        Oliver Yang              Director        Marketing
998  E02521        Lily Nguyen           Sr. Analyst          Finance
999  E03545        Sofia Cheng        Vice President       Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
990  Research & Development    Male      Asian   37 2010-11-29         146961
991  Research & Development    Male     Latino   48 1998-04-22          85369
992           Manufacturing    Male  Caucasian   30 2015-06-14          67489
993           Manufacturing  Female  Caucasian   46 2018-10-06         166259
994               Corporate  Female      Asian   55 2009-01-07          47032
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country      City  Exit Date
990     0.11  United States  Columbus        NaT
991     0.00         Brazil    Manaus 2004-11-27
992     0.00  United States   Chicago        NaT
993     0.17  United States   Chicago        NaT
994     0.00  United States  Columbus        NaT
995     0.00  United States  Columbus        NaT
996     0.00          China   Chengdu 2018-01-08
997     0.15  United States     Miami        NaT
998     0.00          China   Chengdu        NaT
999     0.31  United States     Miami        NaT

In [22]:
# to getting information
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   EEID           1000 non-null   object
 1   Full Name      1000 non-null   object
 2   Job Title      1000 non-null   object
 3   Department     1000 non-null   object
 4   Business Unit  1000 non-null   object
 5   Gender         1000 non-null   object
 6   Ethnicity      1000 non-null   object
 7   Age            1000 non-null   int64
 8   Hire Date      1000 non-null   datetime64[ns]
 9   Annual Salary  1000 non-null   int64
 10  Bonus %        1000 non-null   float64
 11  Country        1000 non-null   object
 12  City           1000 non-null   object
 13  Exit Date      85 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1), int64(2), object(9)
memory usage: 109.5+ KB
None

In [23]:
data.describe()

,Age,Hire Date,Annual Salary,Bonus %,Exit Date
count,1000.000000,1000,1000.000000,1000.000000,85
mean,44.382000,2012-04-07 02:54:14.400000,113217.365000,0.088660,2016-11-02 18:04:14.117647104
min,25.000000,1992-01-09 00:00:00,40063.000000,0.000000,1994-12-18 00:00:00
25%,35.000000,2007-02-14 00:00:00,71430.250000,0.000000,2014-12-25 00:00:00
50%,45.000000,2014-02-15 12:00:00,96557.000000,0.000000,2019-05-23 00:00:00
75%,54.000000,2018-06-22 00:00:00,150782.250000,0.150000,2021-04-09 00:00:00
max,65.000000,2021-12-26 00:00:00,258498.000000,0.400000,2022-08-17 00:00:00
std,11.246981,NaN,53545.985644,0.117856,NaN

In [27]:
# to checking null values
print(data.isnull().sum())

EEID               0
Full Name          0
Job Title          0
Department         0
Business Unit      0
Gender             0
Ethnicity          0
Age                0
Hire Date          0
Annual Salary      0
Bonus %            0
Country            0
City               0
Exit Date        915
dtype: int64

In [36]:
# Dealing with Duplicate value by Pandas
import pandas as pd
data = pd.read_csv("company1.csv")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [32]:
# identify duplicate
print(data["EEID"].duplicated().sum())

2

In [35]:
print(data.drop_duplicates("Name"))

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
4  EMP05       NaN      M  25000.0

# working with missing data in pandas

In [44]:
data = pd.read_csv("company1.csv")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [38]:
print(data.isnull().sum())

EEID      0
Name      1
gender    1
salary    2
dtype: int64

In [39]:
print(data.dropna())

    EEID    Name gender   salary
1  EMP02   rohit      M  25000.0
3  EMP01  ayushi      F  20000.0
6  EMP02   rohit      M  25000.0

In [40]:
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [41]:
import numpy as np
print(data.replace(np.nan, 30000))

    EEID      Name gender   salary
0  EMP01    ayushi      F  30000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali  30000  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     30000      M  25000.0
5  EMP06     rohit      M  30000.0
6  EMP02     rohit      M  25000.0

In [47]:
data["salary"] = data["salary"].replace(np.nan, 24400)
print(data)
print(data["salary"].mean())

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0
24400.0

In [45]:
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [49]:
# using forward and backward filled
print(data.fillna(method = "bfill"))

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     rohit      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

C:\Users\Dell\AppData\Local\Temp\ipykernel_3736\3869959467.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method = "bfill"))

In [50]:
print(data.fillna(method = "ffill"))

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      M  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05    ayushi      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

C:\Users\Dell\AppData\Local\Temp\ipykernel_3736\1391920301.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method = "ffill"))

In [53]:
print(data.fillna("hi"))

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali     hi  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05        hi      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

In [46]:
print(data["salary"].mean())

24400.0

## Columns Transformation in Pandas (Part 1)

In [59]:
import pandas as pd
df = pd.read_excel("ESD.xlsx")
print(data)

df.loc[(df["Bonus %"]==0), "GetsBonus"] = "no bonus"
df.loc[(df["Bonus %"]>0, "GetBonus")] = "bonus"
print(df.head(10))

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]
     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date GetsBonus GetBonus
0     0.15  United States    Seattle 2021-10-16       NaN    bonus
1     0.00          China  Chongqing        NaT  no bonus      NaN
2     0.20  United States    Chicago        NaT       NaN    bonus
3     0.07  United States    Chicago        NaT       NaN    bonus
4     0.00  United States    Phoenix        NaT  no bonus      NaN
5     0.00          China  Chongqing        NaT  no bonus      NaN
6     0.10  United States    Phoenix        NaT       NaN    bonus
7     0.00  United States      Miami 2021-05-20  no bonus      NaN
8     0.06  United States     Austin        NaT       NaN    bonus
9     0.00  United States    Chicago        NaT  no bonus      NaN

In [75]:
data = pd.read_excel("ESD.xlsx")
print(data.head(10))

data["Full Name"] = data["First Name"].str.capitalize()  +"  " +  data["Last Name"].str.capitalize()

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT
5     0.00          China  Chongqing        NaT
6     0.10  United States    Phoenix        NaT
7     0.00  United States      Miami 2021-05-20
8     0.06  United States     Austin        NaT
9     0.00  United States    Chicago        NaT

KeyError: 'First Name'

## Columns Transformation in Pandas Part 2

In [84]:
import pandas as pd
data = pd.read_excel("expense3.xlsx")
print(data.head(10))
data["Bonus"] = (data["Amount"]/100)*5
print(data.head(10))

        Date    Category       Sub-Category   Amount Payment Mode
0 2023-01-01     Grocery             Grocery      30         Cash
1 2023-01-02        Food          Restaurant     890          UPI
2 2023-01-04         123              Zomato     257          NaN
3 2023-01-06  Essentials               Diary     120          UPI
4 2023-01-06  Essentials             Perfume    1500         Cash
5 2023-01-09     Grocery  Fruits and Veggies     456         Cash
6 2023-01-10       Bills          House Rent   16000          UPI
7 2023-01-10     Grocery      Tomato KetchUp      70          UPI
8 2023-01-12        Food                Chai      15          UPI
9 2023-01-15  Essentials      Salt and Sugar      50          NaN
        Date    Category       Sub-Category   Amount Payment Mode   Bonus
0 2023-01-01     Grocery             Grocery      30         Cash    1.50
1 2023-01-02        Food          Restaurant     890          UPI   44.50
2 2023-01-04         123              Zomato     257          NaN   12.85
3 2023-01-06  Essentials               Diary     120          UPI    6.00
4 2023-01-06  Essentials             Perfume    1500         Cash   75.00
5 2023-01-09     Grocery  Fruits and Veggies     456         Cash   22.80
6 2023-01-10       Bills          House Rent   16000          UPI  800.00
7 2023-01-10     Grocery      Tomato KetchUp      70          UPI    3.50
8 2023-01-12        Food                Chai      15          UPI    0.75
9 2023-01-15  Essentials      Salt and Sugar      50          NaN    2.50

In [89]:
data = {"Months": ["January", "February", "March", "April"]}

a = pd.DataFrame(data)
print(a)


def extract(value):
    return value[0:3]

a["Short_months"] = a["Months"].map(extract)
print(a)

     Months
0   January
1  February
2     March
3     April
     Months Short_months
0   January          Jan
1  February          Feb
2     March          Mar
3     April          Apr

## Group by in Pandas

In [91]:
import pandas as pd
data = pd.read_excel("ESD.xlsx")
print(data.head(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT
5     0.00          China  Chongqing        NaT
6     0.10  United States    Phoenix        NaT
7     0.00  United States      Miami 2021-05-20
8     0.06  United States     Austin        NaT
9     0.00  United States    Chicago        NaT

In [97]:
gp = data.groupby(["Department", "Gender"]).agg({"EEID": "count"})
print(gp)

                        EEID
Department      Gender
Accounting      Female    53
                Male      43
Engineering     Female    80
                Male      78
Finance         Female    69
                Male      51
Human Resources Female    64
                Male      61
IT              Female   119
                Male     122
Marketing       Female    57
                Male      63
Sales           Female    76
                Male      64

In [101]:
gp1 = data.groupby(["Country", "Gender"]).agg({"Annual Salary": "max", "Age": "min"})
print(gp1)

                      Annual Salary  Age
Country       Gender
Brazil        Female         258426   25
              Male           249506   26
China         Female         249686   25
              Male           257194   25
United States Female         258498   25
              Male           258081   25

## Merge, Join and Concatenate in Pandas

In [111]:
import pandas as pd
data1 = {"Emp Id": ["E01","E02","E03","E04","E05","E06"],
         "Name": ["Ram", "Shyam", "rahul", "Vishal", "Ravi","John"],
         "Age": [34,56,23,44,32,36]}
data2 = {"Emp Id":["E01","E07","E03","E04","E08","E06"],
         "Salary": [45000,56000,34000,30000,50000,62000]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

print(df1)
print()
print(df2)

  Emp Id    Name  Age
0    E01     Ram   34
1    E02   Shyam   56
2    E03   rahul   23
3    E04  Vishal   44
4    E05    Ravi   32
5    E06    John   36

  Emp Id  Salary
0    E01   45000
1    E07   56000
2    E03   34000
3    E04   30000
4    E08   50000
5    E06   62000

In [113]:
print(pd.merge(left = df1,right = df2,on = "Emp Id", how="left"))

  Emp Id    Name  Age   Salary
0    E01     Ram   34  45000.0
1    E02   Shyam   56      NaN
2    E03   rahul   23  34000.0
3    E04  Vishal   44  30000.0
4    E05    Ravi   32      NaN
5    E06    John   36  62000.0

In [115]:
print(pd.merge(left = df1,right = df2,on = "Emp Id", how="right"))

  Emp Id    Name   Age  Salary
0    E01     Ram  34.0   45000
1    E07     NaN   NaN   56000
2    E03   rahul  23.0   34000
3    E04  Vishal  44.0   30000
4    E08     NaN   NaN   50000
5    E06    John  36.0   62000

In [116]:
print(pd.merge(left = df1, right = df2, on = "Emp Id", how = "right"))

  Emp Id    Name   Age  Salary
0    E01     Ram  34.0   45000
1    E07     NaN   NaN   56000
2    E03   rahul  23.0   34000
3    E04  Vishal  44.0   30000
4    E08     NaN   NaN   50000
5    E06    John  36.0   62000

In [119]:
import pandas as pd
data1 = {"Emp Id": ["E01","E02","E03","E04","E05","E06"],
         "Name": ["Ram", "Shyam", "rahul", "Vishal", "Ravi","John"],
         "Age": [34,56,23,44,32,36]}

data2 = {"Emp Id": ["E07","E08","E09","E010","E011","E012"],
         "Name": ["bittu", "chintu", "pappu", "chotu", "bunty","goly"],
         "Age": [34,56,23,44,32,36]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [120]:
print(pd.concat([df1,df2]))

  Emp Id    Name  Age
0    E01     Ram   34
1    E02   Shyam   56
2    E03   rahul   23
3    E04  Vishal   44
4    E05    Ravi   32
5    E06    John   36
0    E07   bittu   34
1    E08  chintu   56
2    E09   pappu   23
3   E010   chotu   44
4   E011   bunty   32
5   E012    goly   36

## Pandas | compare DataFrames

In [133]:
import pandas as pd

dict = {"Fruit": ["Mango","apples", "banana","papaya"],
        "Price": [100,150,50,35],
        "Quantity": [15,10,10,3]}
df1 = pd.DataFrame(dict)
print(df1)

df2 = df1.copy()

df2.loc[0, "Price"] = 120
df2.loc[1, "Price"] = 175
df2.loc[3, "Price"] = 30
df2.loc[0, "Quantity"] = 12
df2.loc[1, "Quantity"] = 15
df2.loc[3, "Quantity"] = 5

print(df2)
print(df1.compare(df2))
print(df1.compare(df2, keep_shape=False))

    Fruit  Price  Quantity
0   Mango    100        15
1  apples    150        10
2  banana     50        10
3  papaya     35         3
    Fruit  Price  Quantity
0   Mango    120        12
1  apples    175        15
2  banana     50        10
3  papaya     30         5
   Price        Quantity
    self  other     self other
0  100.0  120.0     15.0  12.0
1  150.0  175.0     10.0  15.0
3   35.0   30.0      3.0   5.0
   Price        Quantity
    self  other     self other
0  100.0  120.0     15.0  12.0
1  150.0  175.0     10.0  15.0
3   35.0   30.0      3.0   5.0

## Pandas - Pivoting and Melting DataFrames

In [147]:
import pandas as pd

dict = {"keys": ["k1","k2","k1","k2"],
         "Names": ["John","Ben","David","Peter"],
         "Houses": ["red","blue","green","red"],
         "Grades": ["3rd","8th","9th","8th"]}

df = pd.DataFrame(dict)
print(df)
print(df.pivot(index="keys",columns="Names",values=["Houses","Grades"]))

  keys  Names Houses Grades
0   k1   John    red    3rd
1   k2    Ben   blue    8th
2   k1  David  green    9th
3   k2  Peter    red    8th
      Houses                   Grades
Names    Ben  David John Peter    Ben David John Peter
keys
k1       NaN  green  red   NaN    NaN   9th  3rd   NaN
k2      blue    NaN  NaN   red    8th   NaN  NaN   8th

### Melting variable

In [151]:
dict = { "Names": ["John","Ben","David","Peter"],
         "Houses": ["red","blue","green","red"],
         "Grades": ["3rd","8th","9th","8th"]}

df = pd.DataFrame(dict)
print(df)
print(pd.melt(df, id_vars=["Names"], value_vars=["Houses"], var_name="Houses&Grades", value_name="values"))
# print(df.pivot(index="keys",columns="Names",values=["Houses","Grades"]))

   Names Houses Grades
0   John    red    3rd
1    Ben   blue    8th
2  David  green    9th
3  Peter    red    8th
   Names Houses&Grades values
0   John        Houses    red
1    Ben        Houses   blue
2  David        Houses  green
3  Peter        Houses    red